tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "mongodb/brew"
tap "romkatv/powerlevel10k"
tap "supabase/tap"
brew "gmp"
brew "coreutils"
brew "libyaml"
brew "openssl@3"
brew "readline"
brew "asdf"
brew "bat"
brew "sqlite"
brew "black"
brew "curl"
brew "node"
brew "eslint"
brew "openjpeg"
brew "ffmpeg"
brew "gawk"
brew "gcc"
brew "gh"
brew "git"
brew "gnupg"
brew "openjdk"
brew "gradle"
brew "macos-trash"
brew "make"
brew "mas"
brew "maven"
brew "mypy"
brew "mysql"
brew "tree-sitter", link: false
brew "neovim"
brew "netlify-cli"
brew "openssl@1.1"
brew "pandoc"
brew "pdfgrep"
brew "postgresql@16"
brew "powerlevel10k"
brew "protobuf"
brew "python@3.10"
brew "ripgrep"
brew "ruby"
brew "semgrep"
brew "speedtest-cli"
brew "thefuck"
brew "tldr"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "zsh"
brew "mongodb/brew/mongodb-community"
brew "supabase/tap/supabase"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "anki"
cask "backblaze"
cask "cleanmymac"
cask "db-browser-for-sqlite"
cask "discord"
cask "docker"
cask "drawio"
cask "exodus"
cask "figma"
cask "firefox"
cask "flux"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-ia-writer-duo"
cask "font-ia-writer-duospace"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-lato"
cask "font-sacramento"
cask "github"
cask "google-chrome"
cask "google-drive"
cask "grammarly"
cask "hyperkey"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "keyboardcleantool"
cask "logi-options-plus"
cask "mactex"
cask "messenger"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"
cask "mission-control-plus"
cask "monitorcontrol"
cask "moom"
cask "mos"
cask "notion"
cask "numi"
cask "obsidian"
cask "pdfpen"
cask "postman"
cask "raindropio"
cask "raspberry-pi-imager"
cask "selfcontrol"
cask "sf-symbols"
cask "slack"
cask "soundsource"
cask "spotify"
cask "steam"
cask "transmit"
cask "visual-studio-code"
cask "vitalsource-bookshelf"
cask "vmware-horizon-client"
cask "whatsapp"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Accelerate", id: 1459809092
mas "Amphetamine", id: 937984704
mas "ColorSlurp", id: 1287239339
mas "Dark Noise", id: 1465439395
mas "Dark Reader for Safari", id: 1438243180
mas "Dato", id: 1470584107
mas "Developer", id: 640199958
mas "Drafts", id: 1435957248
mas "Grammarly for Safari", id: 1462114288
mas "Hand Mirror", id: 1502839586
mas "iA Writer", id: 775737590
mas "Instapaper Save", id: 1481302432
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Mela", id: 1568924476
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Reeder", id: 1529448980
mas "StopTheMadness", id: 1376402589
mas "Timery", id: 1425368544
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "alefragnani.Bookmarks"
vscode "asciidoctor.asciidoctor-vscode"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "chrmarti.regex"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.remotehub"
vscode "GitHub.vscode-pull-request-github"
vscode "GitLab.gitlab-workflow"
vscode "golang.go"
vscode "Gruntfuggly.todo-tree"
vscode "HTMLHint.vscode-htmlhint"
vscode "James-Yu.latex-workshop"
vscode "matangover.mypy"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "PKief.material-icon-theme"
vscode "Postman.postman-for-vscode"
vscode "Prisma.prisma"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "ritwickdey.LiveServer"
vscode "Shopify.ruby-extensions-pack"
vscode "Shopify.ruby-lsp"
vscode "sorbet.sorbet-vscode-extension"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-australian-english"
vscode "svelte.svelte-vscode"
vscode "unifiedjs.vscode-mdx"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
