tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
brew "bat"
brew "sqlite"
brew "black"
brew "clang-format"
brew "curl"
brew "openjpeg"
brew "ffmpeg"
brew "gcc"
brew "gh"
brew "git"
brew "openjdk"
brew "gradle"
brew "howdoi"
brew "jenv"
brew "make"
brew "mas"
brew "maven"
brew "mysql"
brew "tree-sitter", link: false
brew "neovim"
brew "netlify-cli"
brew "openjdk@11"
brew "openjdk@17"
brew "pandoc"
brew "pdfgrep"
brew "python@3.10"
brew "ripgrep"
brew "speedtest-cli"
brew "thefuck"
brew "tldr"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "zsh"
brew "romkatv/powerlevel10k/powerlevel10k"
cask "1password"
cask "1password-cli"
cask "aerial"
cask "alfred"
cask "android-studio"
cask "anki"
cask "backblaze"
cask "brave-browser"
cask "diffusionbee"
cask "discord"
cask "drawio"
cask "dropbox"
cask "exodus"
cask "figma"
cask "firefox"
cask "flux"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-ia-writer-duo"
cask "font-ia-writer-duospace"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-lato"
cask "font-sacramento"
cask "github"
cask "google-chrome"
cask "google-drive"
cask "google-earth-pro"
cask "grammarly"
cask "hazel"
cask "hyperkey"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "keyboardcleantool"
cask "kindle"
cask "mactex"
cask "messenger"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"
cask "minecraft"
cask "monitorcontrol"
cask "monodraw"
cask "moom"
cask "mos"
cask "musescore"
cask "notion"
cask "numi"
cask "obsidian"
cask "pdfpen"
cask "raspberry-pi-imager"
cask "selfcontrol"
cask "sf-symbols"
cask "slack"
cask "soundsource"
cask "spotify"
cask "steam"
cask "the-archive"
cask "todoist"
cask "transmit"
cask "visual-studio-code"
cask "vitalsource-bookshelf"
cask "vmware-horizon-client"
cask "whatsapp"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Accelerate", id: 1459809092
mas "Amphetamine", id: 937984704
mas "Dark Noise", id: 1465439395
mas "Dark Reader for Safari", id: 1438243180
mas "Developer", id: 640199958
mas "Drafts", id: 1435957248
mas "GarageBand", id: 682658836
mas "Hand Mirror", id: 1502839586
mas "iA Writer", id: 775737590
mas "Instapaper Save", id: 1481302432
mas "Keynote", id: 409183694
mas "Mela", id: 1568924476
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Progress Bar", id: 1441939775
mas "Reeder", id: 1529448980
mas "StopTheMadness", id: 1376402589
mas "Timery", id: 1425368544
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "alefragnani.Bookmarks"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "chrmarti.regex"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "GitHub.copilot"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.remotehub"
vscode "GitHub.vscode-pull-request-github"
vscode "Gruntfuggly.todo-tree"
vscode "HTMLHint.vscode-htmlhint"
vscode "James-Yu.latex-workshop"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "ritwickdey.LiveServer"
vscode "sdras.night-owl"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
