tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
brew "gmp"
brew "coreutils"
brew "libyaml"
brew "openssl@3"
brew "readline"
brew "asdf"
brew "bat"
brew "sqlite"
brew "black"
brew "curl"
brew "node"
brew "eslint"
brew "gcc"
brew "openjpeg"
brew "ffmpeg"
brew "gh"
brew "git"
brew "gnupg"
brew "openjdk"
brew "gradle"
brew "macos-trash"
brew "make"
brew "mas"
brew "maven"
brew "mypy"
brew "mysql"
brew "tree-sitter", link: false
brew "neovim"
brew "openssl@1.1"
brew "pandoc"
brew "pdfgrep"
brew "postgresql@16", link: true
brew "powerlevel10k"
brew "protobuf"
brew "python@3.10"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "semgrep"
brew "speedtest-cli"
brew "thefuck"
brew "tldr"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "zsh"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "anki"
cask "arc"
cask "backblaze"
cask "bibdesk"
cask "cleanmymac"
cask "db-browser-for-sqlite"
cask "dbngin"
cask "diffusionbee"
cask "discord"
cask "docker"
cask "drawio"
cask "exodus"
cask "figma"
cask "firefox"
cask "flux"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-ia-writer-duo"
cask "font-ia-writer-duospace"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-lato"
cask "font-sacramento"
cask "github"
cask "google-chrome"
cask "grammarly"
cask "hyperkey"
cask "iina"
cask "imageoptim"
cask "inkscape"
cask "iterm2"
cask "keyboardcleantool"
cask "logi-options-plus"
cask "logseq"
cask "mactex"
cask "messenger"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"
cask "miro"
cask "mission-control-plus"
cask "monitorcontrol"
cask "moom"
cask "mos"
cask "notion"
cask "numi"
cask "obsidian"
cask "pdfpen"
cask "postman"
cask "raindropio"
cask "raspberry-pi-imager"
cask "selfcontrol"
cask "sf-symbols"
cask "slack"
cask "soundsource"
cask "spotify"
cask "steam"
cask "transmit"
cask "visual-studio-code"
cask "vmware-horizon-client"
cask "zed"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "asciidoctor.asciidoctor-vscode"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "htmlhint.vscode-htmlhint"
vscode "james-yu.latex-workshop"
vscode "matangover.mypy"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "pkief.material-icon-theme"
vscode "postman.postman-for-vscode"
vscode "quicktype.quicktype"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "ritwickdey.liveserver"
vscode "shengchen.vscode-checkstyle"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sonarsource.sonarlint-vscode"
vscode "sorbet.sorbet-vscode-extension"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-australian-english"
vscode "svelte.svelte-vscode"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
