bdw-gc
berkeley-db
brotli
c-ares
ca-certificates
gdbm
gettext
gh
git
gmp
gnupg
gnutls
guile
htop
icu4c
jansson
jemalloc
libassuan
libev
libevent
libffi
libgcrypt
libgpg-error
libidn2
libksba
libnghttp2
libtasn1
libtermkey
libtool
libunistring
libusb
libuv
libyaml
lua
luajit-openresty
luv
m4
mpdecimal
msgpack
ncurses
neovim
nettle
nghttp2
node
npth
openssl@1.1
p11-kit
paperkey
pcre2
perl
pinentry
pkg-config
python@3.10
python@3.9
readline
restic
ruby
sqlite
tmux
trash-cli
tree-sitter
unbound
unibilium
utf8proc
vim
xz
iina
keepassxc
numi
