tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "node"
brew "eleventy"
brew "gcc"
brew "gh"
brew "git"
brew "gnupg"
brew "htop"
brew "mas"
brew "mysql"
brew "ncdu"
brew "tree-sitter"
brew "neovim"
brew "openjdk"
brew "prettier"
brew "sqlite"
brew "python@3.10"
brew "speedtest-cli"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "zsh"
cask "1password"
cask "alfred"
cask "anki"
cask "backblaze"
cask "brave-browser"
cask "discord"
cask "dropbox"
cask "electron"
cask "figma"
cask "firefox"
cask "flux"
cask "font-fira-mono"
cask "github"
cask "google-chrome"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "kindle"
cask "kitty"
cask "messenger"
cask "minecraft"
cask "moom"
cask "notion"
cask "numi"
cask "obsidian"
cask "spotify"
cask "steam"
cask "the-archive"
cask "todoist"
cask "visual-studio-code"
cask "zoom"
cask "zotero"
mas "Accelerate", id: 1459809092
mas "Amphetamine", id: 937984704
mas "Dark Noise", id: 1465439395
mas "Developer", id: 640199958
mas "Drafts", id: 1435957248
mas "Honey", id: 1472777122
mas "Horo", id: 1437226581
mas "iA Writer", id: 775737590
mas "Instapaper Save", id: 1481302432
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Reeder", id: 1529448980
mas "Spark", id: 1176895641
mas "Xcode", id: 497799835
